app/views/users/index.html.haml

				%td{:class => @title_header}= link_to event.title,user_event_path(session[:user_id],event.id)
				%td=  User.find_by_id(event.ownerid).name
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]