app/views/users/show.html.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
				%td{:class => @title_header}= link_to event.title,user_event_path(params[:id],event.id)
				%td=  User.find_by_id(event.ownerid).name