app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" IS NULL LIMIT 1
---
def new
	@event = Event.new
	@event = Event.find_by_id(params[:id]);

INSERT INTO "events" ("title", "ownerid", "location", "status", "description", "user_id", "endtime", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
def create
	#params[:event][:duration] = params[:event][:endtime] - params[:event][:startime]
	params[:event][:user_id] = session[:user_id]
	@temp = params[:event][:title]
	# logger.debug("VALUE OF TITLW: ")
	# logger.debug(params[:event][:title])

	if params[:event][:title] == ""
		#logger.debug("I AM IN THIS IF CONDITION BIATCHES")
		flash[:notice] = "Title field should not be empty!"
		redirect_to new_user_event_path(session[:user_id])
	#end
	else
		@event = Event.create!(params[:event])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 9]]
---
def show
	@event = Event.find_by_id(params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "events" SET "title" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["title", "helloo"], ["updated_at", "2015-04-25 16:24:16.124744"], ["id", 3]]
---
def update
	@event = Event.find_by_id params[:id]
    @event.update_attributes!(params[:event])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
---
def destroy
	@event = Event.find_by_id(params[:id])
	@event.destroy

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 3]]
---
def edit
    @event = Event.find_by_id params[:id]