app/controllers/sessions_controller.rb

SELECT COUNT(*) FROM "users"
---
  def login
  	@numUsers = User.all.size

INSERT INTO "users" ("provider", "uid", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["provider", "facebook"], ["uid", "10153298211173086"], ["name", "Irtaza Safi"], ["created_at", "2015-04-25 11:20:01.972675"], ["updated_at", "2015-04-25 11:20:01.972675"]]
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? LIMIT 1  [["provider", "facebook"], ["uid", "10153298211173086"]]
---
  def create
  	auth=request.env["omniauth.auth"]
    user=User.find_by_provider_and_uid(auth["provider"],auth["uid"]) ||
      User.create_with_omniauth(auth)