app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@currUser = User.find_by_id(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
	def view

		@currUser = User.find_by_id(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	def displayUsers
		currUser = User.find_by_id(params[:id])

INSERT INTO "friends" ("uid", "name", "email", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["uid", "2"], ["name", "Umaira Sajjad"], ["email", ""], ["user_id", 1], ["created_at", "2015-05-24 14:32:33.104597"], ["updated_at", "2015-05-24 14:32:33.104597"]]
---
	def addFriend
		# friend_to_add = User.find_by_name(params[:name]);
		# currUser = User.find_by_id(params[:id])
		# Friend.create!({:uid => friend_to_add.uid, :provider=>friend_to_add.provider,
		# 	:name=>friend_to_add.name,:first_name=>friend_to_add.first_name,
		# 	:last_name=>friend_to_add.last_name,:about=>friend_to_add.about,
		# 	:gender=>friend_to_add.gender,:work=>friend_to_add.work,
		# 	:email=>friend_to_add.email,:education=>friend_to_add.education,
		# 	:user_id => params[:id]});

		data_of_friend = Friend.getHash (params[:name])
		Friend.create!(data_of_friend, {:user_id => params[:id]})

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT 1  [["name", "Usman Nadeem"]]
---
	def setMeeting
		currUser_events  = User.find_by_id(params[:id]).events
		otherUser_events = User.find_by_name(params[:friend_id]).events